06-impressao.org
#+setupfile: static/setupfile.org
#+html_link_up: index.html
#+title: Impressão
#+startup: content

#+property: header-args:rust :tangle src/printing/mod.rs

Arquivo: ~printing/mod.rs~.

* Importações

#+begin_src rust
use std::fmt::Write;
use gc::Gc;
use crate::core::{ Maj, MajState };
use crate::core::types::MajStream;
use crate::axioms::predicates::{
    maj_nilp,
    maj_stringp,
    maj_closurep,
    maj_primitivep,
    maj_macrop
};
use crate::axioms::primitives::{
    maj_car,
    maj_cdr
};
#+end_src

* Formatação

** Formatação genérica

#+begin_src rust
pub fn maj_format(state: &MajState, obj: Gc<Maj>) -> String {
    maj_format_raw(state, obj, true)
}
#+end_src

#+begin_src rust
pub fn maj_format_raw(
    state: &MajState,
    obj: Gc<Maj>,
    format_read_macros: bool
) -> String {
    match &*obj.clone() {
        Maj::Sym(_) => obj.symbol_name(&state),
        Maj::Cons { car: _, cdr: _ } =>
            maj_format_list(&state, obj, format_read_macros),
        Maj::Char(c) => maj_format_char(*c),
        Maj::Stream(s) => maj_format_stream(s, obj),
        Maj::Vector(_) =>
            maj_format_vector(&state, obj, format_read_macros),
        _ => format!("{}", obj)
    }
}
#+end_src

** Formatação de caracteres

#+begin_src rust
pub fn maj_format_char(c: char) -> String {
    let f;
    format!("#\\{}",
            match c {
                '\x07' => "␇",
                ' ' => "space",
                '\n' => "newline",
                '\t' => "tab",
                _ => {
                    f = format!("{}", c);
                    &f
                },
            })
}
#+end_src

