06-impressao.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Impressão</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Impressão</h1>
<p>
Arquivo: <code>printing/mod.rs</code>.
</p>

<div id="outline-container-org14a1ddc" class="outline-2">
<h2 id="org14a1ddc"><span class="section-number-2">1.</span> Importações</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">std</span>::<span style="color: #569cd6;">fmt</span>::<span style="color: #4ec9b0;">Write</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::<span style="color: #4ec9b0;">Gc</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::{ <span style="color: #4ec9b0;">Maj</span>, <span style="color: #4ec9b0;">MajState</span> };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajStream</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::{
    maj_nilp,
    maj_stringp,
    maj_closurep,
    maj_primitivep,
    maj_macrop
};
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
    maj_car,
    maj_cdr
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org4440a07" class="outline-2">
<h2 id="org4440a07"><span class="section-number-2">2.</span> Formatação</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7d644fc" class="outline-3">
<h3 id="org7d644fc"><span class="section-number-3">2.1.</span> Formatação genérica</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">obj</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">String</span> {
    maj_format_raw(state, obj, <span style="color: #569cd6;">true</span>)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_raw</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">obj</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">format_read_macros</span>: <span style="color: #4ec9b0;">bool</span>
) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*obj.clone() {
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(_) =&gt; obj.symbol_name(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state),
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { <span style="color: #9cdcfe;">car</span>: _, <span style="color: #9cdcfe;">cdr</span>: _ } =&gt;
            maj_format_list(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, obj, format_read_macros),
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Char</span>(c) =&gt; maj_format_char(*c),
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Stream</span>(s) =&gt; maj_format_stream(s, obj),
        <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(_) =&gt;
            maj_format_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, obj, format_read_macros),
        _ =&gt; <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, obj)
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga465e42" class="outline-3">
<h3 id="orga465e42"><span class="section-number-3">2.2.</span> Formatação de caracteres</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_char</span>(<span style="color: #9cdcfe;">c</span>: <span style="color: #4ec9b0;">char</span>) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">f</span>;
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"#\\</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
            <span style="color: #569cd6;">match</span> c {
                <span style="color: #ce9178;">'\x07'</span> =&gt; <span style="color: #ce9178;">"&#9223;"</span>,
                <span style="color: #ce9178;">' '</span> =&gt; <span style="color: #ce9178;">"space"</span>,
                <span style="color: #ce9178;">'\n'</span> =&gt; <span style="color: #ce9178;">"newline"</span>,
                <span style="color: #ce9178;">'\t'</span> =&gt; <span style="color: #ce9178;">"tab"</span>,
                _ =&gt; {
                    f = <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, c);
                    <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>f
                },
            })
}
</pre>
</div>
</div>
</div>
