06-impressao.org
** Formatação de listas

#+begin_src rust
fn maj_format_list(
    state: &MajState,
    list: Gc<Maj>,
    rm: bool
) -> String {
    use crate::axioms::predicates::maj_errorp;
    use crate::evaluator::evaluation::{
        maj_quotep,
        maj_unquotep,
        maj_quasiquotep,
        maj_unquote_splice_p
    };

    if rm {
        if maj_quotep(list.clone()).to_bool() {
            return format!(
                "'{}", maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        } else if maj_quasiquotep(list.clone()).to_bool() {
            return format!(
                "`{}", maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        } else if maj_unquotep(list.clone()).to_bool() {
            return format!(
                ",{}", maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        } else if maj_unquote_splice_p(list.clone()).to_bool() {
            return format!(
                ",@{}", maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        }
    }
    
    if maj_errorp(list.clone()).to_bool() {
        // Handle errors
        return maj_format_error(&state, list, rm);
    } else if maj_closurep(list.clone()).to_bool() && rm {
        // Handle closures
        return maj_format_closure(&state, list, rm);
    } else if maj_primitivep(list.clone()).to_bool() && rm {
        // Handle primitives
        return maj_format_primitive(&state, list, rm);
    } else if maj_macrop(list.clone()).to_bool() && rm {
        // Handle macros
        return maj_format_macro(&state, list, rm);
    }

    // Handle all other lists
    let mut buffer = String::new();
    let mut itr = list.clone();
    write!(&mut buffer, "(").unwrap();
    loop {
        match &*itr.clone() {
            Maj::Cons { car, cdr } => {
                write!(&mut buffer, "{}",
                       maj_format_raw(
                           &state, car.clone(),
                           rm))
                    .unwrap();
                if maj_nilp(cdr.clone()).to_bool() {
                    break;
                }
                if let Maj::Cons { car: _, cdr: _ } = *cdr.clone() {
                    write!(&mut buffer, " ").unwrap();
                    itr = cdr.clone();
                } else {
                    write!(&mut buffer, " . {}",
                           maj_format_raw(
                               &state, cdr.clone(),
                               rm))
                        .unwrap();
                    break;
                }
            },
            _ => panic!("Cannot print ordinary object as a list")
        }
    }
    write!(&mut buffer, ")").unwrap();
    buffer
}
#+end_src

