06-impressao.html

<div id="outline-container-org83be96a" class="outline-3">
<h3 id="org83be96a"><span class="section-number-3">2.3.</span> Formatação de listas</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_list</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">list</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rm</span>: <span style="color: #4ec9b0;">bool</span>
) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_errorp;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">evaluator</span>::<span style="color: #569cd6;">evaluation</span>::{
        maj_quotep,
        maj_unquotep,
        maj_quasiquotep,
        maj_unquote_splice_p
    };

    <span style="color: #569cd6;">if</span> rm {
        <span style="color: #569cd6;">if</span> maj_quotep(list.clone()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #c586c0;">format!</span>(
                <span style="color: #ce9178;">"'</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_quasiquotep(list.clone()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #c586c0;">format!</span>(
                <span style="color: #ce9178;">"`</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_unquotep(list.clone()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #c586c0;">format!</span>(
                <span style="color: #ce9178;">",</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_unquote_splice_p(list.clone()).to_bool() {
            <span style="color: #569cd6;">return</span> <span style="color: #c586c0;">format!</span>(
                <span style="color: #ce9178;">",@</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_raw(
                    state,
                    maj_car(maj_cdr(list)),
                    rm));
        }
    }
    
    <span style="color: #569cd6;">if</span> maj_errorp(list.clone()).to_bool() {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Handle errors</span>
        <span style="color: #569cd6;">return</span> maj_format_error(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, list, rm);
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_closurep(list.clone()).to_bool() &amp;&amp; rm {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Handle closures</span>
        <span style="color: #569cd6;">return</span> maj_format_closure(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, list, rm);
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_primitivep(list.clone()).to_bool() &amp;&amp; rm {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Handle primitives</span>
        <span style="color: #569cd6;">return</span> maj_format_primitive(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, list, rm);
    } <span style="color: #569cd6;">else</span> <span style="color: #569cd6;">if</span> maj_macrop(list.clone()).to_bool() &amp;&amp; rm {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Handle macros</span>
        <span style="color: #569cd6;">return</span> maj_format_macro(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, list, rm);
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Handle all other lists</span>
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = <span style="color: #4ec9b0;">String</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span> = list.clone();
    <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"("</span>).unwrap();
    <span style="color: #569cd6;">loop</span> {
        <span style="color: #569cd6;">match</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*itr.clone() {
            <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { car, cdr } =&gt; {
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                       maj_format_raw(
                           <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, car.clone(),
                           rm))
                    .unwrap();
                <span style="color: #569cd6;">if</span> maj_nilp(cdr.clone()).to_bool() {
                    <span style="color: #569cd6;">break</span>;
                }
                <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Cons</span> { <span style="color: #9cdcfe;">car</span>: _, <span style="color: #9cdcfe;">cdr</span>: _ } = *cdr.clone() {
                    <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">" "</span>).unwrap();
                    itr = cdr.clone();
                } <span style="color: #569cd6;">else</span> {
                    <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">" . </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
                           maj_format_raw(
                               <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, cdr.clone(),
                               rm))
                        .unwrap();
                    <span style="color: #569cd6;">break</span>;
                }
            },
            _ =&gt; <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Cannot print ordinary object as a list"</span>)
        }
    }
    <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">")"</span>).unwrap();
    buffer
}
</pre>
</div>
</div>
</div>
