06-impressao.org
** Formatação de vetores

#+begin_src rust
fn maj_format_vector(
    state: &MajState,
    vector: Gc<Maj>,
    rm: bool
) -> String {
    let mut buffer = String::new();
    use crate::core::types::MajVector;

    if let Maj::Vector(vector) = &*vector {
        match vector {
            MajVector::Integer(v) => {
                write!(&mut buffer, "[").unwrap();
                let len = v.borrow().len();
                for (i, int) in v.borrow().iter().enumerate() {
                    write!(&mut buffer, "{}{}",
                           int,
                           if (i + 1) < len {
                               " "
                           } else {
                               ""
                           }).unwrap();
                }
                write!(&mut buffer, "]").unwrap();
            },
            MajVector::Float(v) => {
                use crate::axioms::utils::format_raw_float;
                write!(&mut buffer, "[").unwrap();
                let len = v.borrow().len();
                for (i, fl) in v.borrow().iter().enumerate() {
                    // Bug com casas decimais?
                    write!(&mut buffer, "{}{}",
                           format_raw_float(*fl),
                           if (i + 1) < len {
                               " "
                           } else {
                               ""
                           }).unwrap();
                }
                write!(&mut buffer, "]").unwrap();
            },
            MajVector::Char(s) => {
                write!(&mut buffer, "\"{}\"",
                       s.borrow()).unwrap();
            },
            MajVector::Any(v) => {
                write!(&mut buffer, "[").unwrap();
                let len = v.borrow().len();
                for (i, obj) in v.borrow().iter().enumerate() {
                    write!(&mut buffer, "{}{}",
                           maj_format_raw(&state, obj.clone(), rm),
                           if (i + 1) < len {
                               " "
                           } else {
                               ""
                           }).unwrap();
                }
                write!(&mut buffer, "]").unwrap();
            },
        }
    } else {
        panic!("Vector printing on non-vector object");
    }
    buffer
}
#+end_src

** Formatação de clausuras

#+begin_src rust
fn maj_format_closure(
    state: &MajState,
    closure: Gc<Maj>,
    rm: bool
) -> String {
    // Lambda list is fourth element (cadddr).
    // Sorry for this ugly thing.
    let lambda_list = maj_car(
        maj_cdr(maj_cdr(maj_cdr(closure.clone()))));
    format!("#<function (fn {}) {{{:p}}}>",
           maj_format_raw(&state, lambda_list, rm),
           Gc::into_raw(closure))
}
#+end_src

** Formatação de macros

#+begin_src rust
fn maj_format_macro(state: &MajState, mac: Gc<Maj>, rm: bool) -> String {
    let closure = maj_car(maj_cdr(maj_cdr(mac)));
    let lambda_list = maj_car(
        maj_cdr(maj_cdr(maj_cdr(closure.clone()))));
    format!("#<macro (mac {}) {{{:p}}}>",
            maj_format_raw(&state, lambda_list, rm),
            Gc::into_raw(closure))
}
#+end_src

