06-impressao.html

<div id="outline-container-org344fd32" class="outline-3">
<h3 id="org344fd32"><span class="section-number-3">2.4.</span> Formatação de vetores</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_vector</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">vector</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rm</span>: <span style="color: #4ec9b0;">bool</span>
) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = <span style="color: #4ec9b0;">String</span>::new();
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajVector</span>;

    <span style="color: #569cd6;">if</span> <span style="color: #569cd6;">let</span> <span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Vector</span>(vector) = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>*vector {
        <span style="color: #569cd6;">match</span> vector {
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Integer</span>(v) =&gt; {
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"["</span>).unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">for</span> (i, int) <span style="color: #569cd6;">in</span> v.borrow().iter().enumerate() {
                    <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}{}</span><span style="color: #ce9178;">"</span>,
                           int,
                           <span style="color: #569cd6;">if</span> (i + 1) &lt; len {
                               <span style="color: #ce9178;">" "</span>
                           } <span style="color: #569cd6;">else</span> {
                               <span style="color: #ce9178;">""</span>
                           }).unwrap();
                }
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"]"</span>).unwrap();
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Float</span>(v) =&gt; {
                <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::format_raw_float;
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"["</span>).unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">for</span> (i, fl) <span style="color: #569cd6;">in</span> v.borrow().iter().enumerate() {
                    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Bug com casas decimais?</span>
                    <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}{}</span><span style="color: #ce9178;">"</span>,
                           format_raw_float(*fl),
                           <span style="color: #569cd6;">if</span> (i + 1) &lt; len {
                               <span style="color: #ce9178;">" "</span>
                           } <span style="color: #569cd6;">else</span> {
                               <span style="color: #ce9178;">""</span>
                           }).unwrap();
                }
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"]"</span>).unwrap();
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Char</span>(s) =&gt; {
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"\"{}\""</span>,
                       s.borrow()).unwrap();
            },
            <span style="color: #4ec9b0;">MajVector</span>::<span style="color: #4ec9b0;">Any</span>(v) =&gt; {
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"["</span>).unwrap();
                <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = v.borrow().len();
                <span style="color: #569cd6;">for</span> (i, obj) <span style="color: #569cd6;">in</span> v.borrow().iter().enumerate() {
                    <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}{}</span><span style="color: #ce9178;">"</span>,
                           maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, obj.clone(), rm),
                           <span style="color: #569cd6;">if</span> (i + 1) &lt; len {
                               <span style="color: #ce9178;">" "</span>
                           } <span style="color: #569cd6;">else</span> {
                               <span style="color: #ce9178;">""</span>
                           }).unwrap();
                }
                <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"]"</span>).unwrap();
            },
        }
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Vector printing on non-vector object"</span>);
    }
    buffer
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc12b7c5" class="outline-3">
<h3 id="orgc12b7c5"><span class="section-number-3">2.5.</span> Formatação de clausuras</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_closure</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">closure</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rm</span>: <span style="color: #4ec9b0;">bool</span>
) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Lambda list is fourth element (cadddr).</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Sorry for this ugly thing.</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">lambda_list</span> = maj_car(
        maj_cdr(maj_cdr(maj_cdr(closure.clone()))));
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"#&lt;function (fn </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">) {{</span><span style="color: #ce9178; font-style: italic;">{:p}</span><span style="color: #ce9178;">}}&gt;"</span>,
           maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, lambda_list, rm),
           <span style="color: #4ec9b0;">Gc</span>::into_raw(closure))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb484d8" class="outline-3">
<h3 id="orgeb484d8"><span class="section-number-3">2.6.</span> Formatação de macros</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_macro</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">mac</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">rm</span>: <span style="color: #4ec9b0;">bool</span>) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">closure</span> = maj_car(maj_cdr(maj_cdr(mac)));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">lambda_list</span> = maj_car(
        maj_cdr(maj_cdr(maj_cdr(closure.clone()))));
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"#&lt;macro (mac </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">) {{</span><span style="color: #ce9178; font-style: italic;">{:p}</span><span style="color: #ce9178;">}}&gt;"</span>,
            maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, lambda_list, rm),
            <span style="color: #4ec9b0;">Gc</span>::into_raw(closure))
}
</pre>
</div>
</div>
</div>
