06-impressao.org
** Formatação de primitivas

#+begin_src rust
fn maj_format_primitive(
    state: &MajState,
    primitive: Gc<Maj>,
    rm: bool
) -> String {
    // Symbol for primitive is third element (caddr)
    let prim_sym = maj_car(maj_cdr(maj_cdr(primitive.clone())));
    // Arity for primitive starts at fourth element (cdddr)
    let prim_arity = maj_cdr(maj_cdr(maj_cdr(primitive)));
    format!("#<function (prim {} (arity {}))>",
            maj_format_raw(&state, prim_sym, rm),
            maj_format_raw(&state, prim_arity, rm))
}
#+end_src

** Formatação de erros

#+begin_src rust
fn maj_format_error(state: &MajState, error: Gc<Maj>, rm: bool) -> String {
    use crate::axioms::primitives::maj_format_prim;
    // (lit error fmt . rest)
    let fmt  = maj_car(maj_cdr(maj_cdr(error.clone())));
    let rest = maj_cdr(maj_cdr(maj_cdr(error)));
    let formatted = maj_format_prim(&state, fmt, rest);
    let formatted = maj_format_raw(&state, formatted, rm);
    let len = formatted.len();
    format!("{}", &formatted[1..len-1])
}
#+end_src

** Formatação de streams

#+begin_src rust
fn maj_format_stream(s: &MajStream, obj: Gc<Maj>) -> String {
    use crate::core::types::MajStreamDirection;
    format!("#<stream ({}) {{{:p}}}>",
            match s.direction {
                MajStreamDirection::In  => "in",
                MajStreamDirection::Out => "out",
            },
            Gc::into_raw(obj))
}
#+end_src

** TODO Pretty printing

Ligeiramente   adaptado   do  blog   de   PicoLisp,   como  visto   em
[[https://picolisp.com/wiki/?prettyPrint]].

#+begin_src rust
fn maj_pformat_helper(
    state: &MajState,
    obj: Gc<Maj>,
    ind: u64,
) -> String {
    use crate::axioms::predicates::maj_atomp;
    use crate::axioms::primitives::maj_length;
    let indent_max = 8;

    let mut buffer = String::new();
    for _ in 0..ind {
        write!(&mut buffer, " ").unwrap();
    }

    if maj_atomp(obj.clone()).to_bool()
        || maj_stringp(obj.clone()).to_bool()
        || (maj_length(obj.clone())
            .to_integer()
            .unwrap() < indent_max)
    {
        write!(&mut buffer, "{}",
               maj_format(&state, obj))
            .unwrap();
    } else {
        write!(&mut buffer, "(").unwrap();
        write!(&mut buffer, "{}",
               maj_format(
                   &state,
                   maj_car(obj.clone())))
            .unwrap();
        let mut itr = maj_cdr(obj.clone());

        // TODO: Add check for special forms:
        // (and (member (prin1 (pop x)) *specials*)
        //      ...)
        while maj_length(itr.clone())
            .to_integer()
            .unwrap() >= indent_max
        {
            write!(&mut buffer, " ").unwrap();
            itr = maj_cdr(itr);
        }

        itr = maj_cdr(obj.clone());
        while !maj_nilp(itr.clone()).to_bool() {
            write!(&mut buffer, "\n{}",
            maj_pformat_helper(&state,
                               maj_car(itr.clone()),
                               ind + 2))
                   .unwrap();
            itr = maj_cdr(itr);
        }
        write!(&mut buffer, ")").unwrap();
    }
    buffer
}
#+end_src

#+begin_src rust
pub fn maj_pretty_format(state: &MajState,obj: Gc<Maj>) -> String {
    maj_pformat_helper(state, obj, 0)
}
#+end_src

* Impressão de contexto

