06-impressao.html

<div id="outline-container-org6c2b45f" class="outline-3">
<h3 id="org6c2b45f"><span class="section-number-3">2.7.</span> Formatação de primitivas</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_primitive</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">primitive</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">rm</span>: <span style="color: #4ec9b0;">bool</span>
) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Symbol for primitive is third element (caddr)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">prim_sym</span> = maj_car(maj_cdr(maj_cdr(primitive.clone())));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Arity for primitive starts at fourth element (cdddr)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">prim_arity</span> = maj_cdr(maj_cdr(maj_cdr(primitive)));
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"#&lt;function (prim </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;"> (arity </span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">))&gt;"</span>,
            maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, prim_sym, rm),
            maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, prim_arity, rm))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org320c1c1" class="outline-3">
<h3 id="org320c1c1"><span class="section-number-3">2.8.</span> Formatação de erros</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_error</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">error</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #9cdcfe;">rm</span>: <span style="color: #4ec9b0;">bool</span>) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_format_prim;
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit error fmt . rest)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span>  = maj_car(maj_cdr(maj_cdr(error.clone())));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">rest</span> = maj_cdr(maj_cdr(maj_cdr(error)));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">formatted</span> = maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, fmt, rest);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">formatted</span> = maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, formatted, rm);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">len</span> = formatted.len();
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>formatted[1..len-1])
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd575f20" class="outline-3">
<h3 id="orgd575f20"><span class="section-number-3">2.9.</span> Formatação de streams</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_stream</span>(<span style="color: #9cdcfe;">s</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajStream</span>, <span style="color: #9cdcfe;">obj</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajStreamDirection</span>;
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"#&lt;stream (</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">) {{</span><span style="color: #ce9178; font-style: italic;">{:p}</span><span style="color: #ce9178;">}}&gt;"</span>,
            <span style="color: #569cd6;">match</span> s.direction {
                <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>  =&gt; <span style="color: #ce9178;">"in"</span>,
                <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span> =&gt; <span style="color: #ce9178;">"out"</span>,
            },
            <span style="color: #4ec9b0;">Gc</span>::into_raw(obj))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b92226" class="outline-3">
<h3 id="org6b92226"><span class="section-number-3">2.10.</span> <span class="todo TODO">TODO</span> Pretty printing</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Ligeiramente   adaptado   do  blog   de   PicoLisp,   como  visto   em
<a href="https://picolisp.com/wiki/?prettyPrint">https://picolisp.com/wiki/?prettyPrint</a>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_pformat_helper</span>(
    <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,
    <span style="color: #9cdcfe;">obj</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;,
    <span style="color: #9cdcfe;">ind</span>: <span style="color: #4ec9b0;">u64</span>,
) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_atomp;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_length;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">indent_max</span> = 8;

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = <span style="color: #4ec9b0;">String</span>::new();
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">_</span> <span style="color: #569cd6;">in</span> 0..ind {
        <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">" "</span>).unwrap();
    }

    <span style="color: #569cd6;">if</span> maj_atomp(obj.clone()).to_bool()
        || maj_stringp(obj.clone()).to_bool()
        || (maj_length(obj.clone())
            .to_integer()
            .unwrap() &lt; indent_max)
    {
        <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
               maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, obj))
            .unwrap();
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"("</span>).unwrap();
        <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
               maj_format(
                   <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state,
                   maj_car(obj.clone())))
            .unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">itr</span> = maj_cdr(obj.clone());

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">TODO: Add check for special forms:</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(and (member (prin1 (pop x)) *specials*)</span>
        <span style="color: #6a9955;">//      </span><span style="color: #6a9955;">...)</span>
        <span style="color: #569cd6;">while</span> maj_length(itr.clone())
            .to_integer()
            .unwrap() &gt;= indent_max
        {
            <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">" "</span>).unwrap();
            itr = maj_cdr(itr);
        }

        itr = maj_cdr(obj.clone());
        <span style="color: #569cd6;">while</span> !maj_nilp(itr.clone()).to_bool() {
            <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"\n</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>,
            maj_pformat_helper(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state,
                               maj_car(itr.clone()),
                               ind + 2))
                   .unwrap();
            itr = maj_cdr(itr);
        }
        <span style="color: #c586c0;">write!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">")"</span>).unwrap();
    }
    buffer
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_pretty_format</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>,<span style="color: #9cdcfe;">obj</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">String</span> {
    maj_pformat_helper(state, obj, 0)
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2cfc6c4" class="outline-2">
<h2 id="org2cfc6c4"><span class="section-number-2">3.</span> Impressão de contexto</h2>
<div class="outline-text-2" id="text-3">
</div>
