06-impressao.org
** Impressão comum

#+begin_src rust
#[cfg(not(target_arch = "wasm32"))]
pub fn maj_format_env(state: &MajState, env: Gc<Maj>) -> String {
    use comfy_table::*;
    use comfy_table::presets::UTF8_FULL;
    use comfy_table::modifiers::UTF8_ROUND_CORNERS;

    let mut table = Table::new();
    table.load_preset(UTF8_FULL);
    table.apply_modifier(UTF8_ROUND_CORNERS);
    table.set_content_arrangement(ContentArrangement::Dynamic);
    table.set_header(&vec!["Symbol", "Value"]);

    let mut iter = env.clone();
    while !maj_nilp(iter.clone()).to_bool() {
        let pair = maj_car(iter.clone());
        let sym  = maj_car(pair.clone());
        let val  = maj_cdr(pair);

        table.add_row(vec![
            maj_format(&state, sym),
            maj_format(&state, val),
        ]);

        iter = maj_cdr(iter);
    }
    format!("{}", table)
}
#+end_src

** Impressão simples (para WebAssembly)

#+begin_src rust
#[cfg(target_arch = "wasm32")]
#[inline]
pub fn maj_format_env_hline() -> String {
    format!("+{:-<21}+{:-<61}+", "", "")
}

#[cfg(target_arch = "wasm32")]
pub fn maj_format_env(state: &MajState, env: Gc<Maj>) -> String {
    use crate::axioms::utils::truncate_format;
    let mut buffer = String::new();
    let mut iter = env.clone();
    let _ =
        writeln!(&mut buffer, "{}", maj_format_env_hline())
        .unwrap();
    let _ =
        writeln!(&mut buffer, "|{:<21}|{:<61}|",
                 " Symbol", " Value");
    let _ =
        writeln!(&mut buffer, "{}", maj_format_env_hline())
        .unwrap();
    while !maj_nilp(iter.clone()).to_bool() {
        let pair = maj_car(iter.clone());
        let sym  = maj_car(pair.clone());
        let val  = maj_cdr(pair);
        let _ =
            writeln!(&mut buffer,
                     "| {:<20}| {:<60}|",
                     truncate_format(
                         maj_format(&state, sym.clone()),
                         20),
                     truncate_format(
                         maj_format(&state, val),
                     60))
            .unwrap();
        iter = maj_cdr(iter.clone());
    }
    let _ =
        writeln!(&mut buffer, "{}", maj_format_env_hline())
        .unwrap();
    buffer
}
#+end_src

