06-impressao.html
<div id="outline-container-orga52d058" class="outline-3">
<h3 id="orga52d058"><span class="section-number-3">3.1.</span> Impressão comum</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[cfg(not(target_arch = </span><span style="color: #ce9178;">"wasm32"</span><span style="color: #c586c0;">))]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_env</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">comfy_table</span>::*;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">comfy_table</span>::<span style="color: #569cd6;">presets</span>::<span style="color: #4ec9b0;">UTF8_FULL</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">comfy_table</span>::<span style="color: #569cd6;">modifiers</span>::<span style="color: #4ec9b0;">UTF8_ROUND_CORNERS</span>;

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">table</span> = <span style="color: #4ec9b0;">Table</span>::new();
    table.load_preset(<span style="color: #4ec9b0;">UTF8_FULL</span>);
    table.apply_modifier(<span style="color: #4ec9b0;">UTF8_ROUND_CORNERS</span>);
    table.set_content_arrangement(<span style="color: #4ec9b0;">ContentArrangement</span>::<span style="color: #4ec9b0;">Dynamic</span>);
    table.set_header(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"Symbol"</span>, <span style="color: #ce9178;">"Value"</span>]);

    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">iter</span> = env.clone();
    <span style="color: #569cd6;">while</span> !maj_nilp(iter.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">pair</span> = maj_car(iter.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span>  = maj_car(pair.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">val</span>  = maj_cdr(pair);

        table.add_row(<span style="color: #c586c0;">vec!</span>[
            maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, sym),
            maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, val),
        ]);

        iter = maj_cdr(iter);
    }
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, table)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4140153" class="outline-3">
<h3 id="org4140153"><span class="section-number-3">3.2.</span> Impressão simples (para WebAssembly)</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[cfg(target_arch = </span><span style="color: #ce9178;">"wasm32"</span><span style="color: #c586c0;">)]</span>
<span style="color: #c586c0;">#[inline]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_env_hline</span>() -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"+</span><span style="color: #ce9178; font-style: italic;">{:-&lt;21}</span><span style="color: #ce9178;">+</span><span style="color: #ce9178; font-style: italic;">{:-&lt;61}</span><span style="color: #ce9178;">+"</span>, <span style="color: #ce9178;">""</span>, <span style="color: #ce9178;">""</span>)
}

<span style="color: #c586c0;">#[cfg(target_arch = </span><span style="color: #ce9178;">"wasm32"</span><span style="color: #c586c0;">)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">maj_format_env</span>(<span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">MajState</span>, <span style="color: #9cdcfe;">env</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::truncate_format;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = <span style="color: #4ec9b0;">String</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">iter</span> = env.clone();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
        <span style="color: #c586c0;">writeln!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_env_hline())
        .unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
        <span style="color: #c586c0;">writeln!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"|</span><span style="color: #ce9178; font-style: italic;">{:&lt;21}</span><span style="color: #ce9178;">|</span><span style="color: #ce9178; font-style: italic;">{:&lt;61}</span><span style="color: #ce9178;">|"</span>,
                 <span style="color: #ce9178;">" Symbol"</span>, <span style="color: #ce9178;">" Value"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
        <span style="color: #c586c0;">writeln!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_env_hline())
        .unwrap();
    <span style="color: #569cd6;">while</span> !maj_nilp(iter.clone()).to_bool() {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">pair</span> = maj_car(iter.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span>  = maj_car(pair.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">val</span>  = maj_cdr(pair);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
            <span style="color: #c586c0;">writeln!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer,
                     <span style="color: #ce9178;">"| {:&lt;20}| {:&lt;60}|"</span>,
                     truncate_format(
                         maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, sym.clone()),
                         20),
                     truncate_format(
                         maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, val),
                     60))
            .unwrap();
        iter = maj_cdr(iter.clone());
    }
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> =
        <span style="color: #c586c0;">writeln!</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> buffer, <span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, maj_format_env_hline())
        .unwrap();
    buffer
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 23:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
